essay/hello_world.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-19 Fri 21:06 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hello World</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kazuaki Ishiguro">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../essay"> UP </a>
 |
 <a accesskey="H" href="../"> HOME </a>
</div><div id="content">
<h1 class="title">Hello World</h1>
<p>
Do you remember the day you first wrote the Hello World program?
</p>

<p>
In my case, I don&rsquo;t remember anymore, but the excitement of simply telling the computer to do what I wanted it to do, and then automating the rest of the process, has remained with me for a long time now.
</p>

<p>
If this world is a simulation, then I may have succeeded in creating and automating another Hello World program in it.
</p>

<p>
And I want to swear one thing here.
</p>

<p>
I will continue to love this program with all my heart and soul until I am finished with it.
</p>

<p>
Welcome to the world, Hasu.
</p>

<p>
From noob as a father
</p>

<hr>

<p>
あなたは最初にHello Worldのプログラムを書いた日を覚えているだろうか？
</p>

<p>
私の場合はもう覚えていないが、単純にコンピューターを自分の動かしたい様に指示を与え、その後の動作を自動化する事に興奮を覚えてから長い時間が経った今でもその興奮から覚めることが無いままである。
</p>

<p>
この世の中はシミュレーションだとすれば、私はその中でもう一つのハローワールドのプログラムを生み出し、自動化する事に成功したのかもしれない。
</p>

<p>
そして一つだけここに誓いたい。
</p>

<p>
このプログラムは私がその役目を終えるまで心から大切に、愛を込めて関わり続ける事を。
</p>

<p>
ようこそ世界、蓉。
</p>

<p>
父としての初心者より
</p>

<hr>

<p>
kazuaki
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-12-26 Sat&gt;</span></span>
</p>
</div>
</body>
</html>
